; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v8 - type_2 ?v2 - type_3)
 	      (pred_2 ?v4 - object ?v2 - type_3)
	      (pred_1 ?v8 - type_2 ?v1 - type_1)
	      (pred_3 ?v8 - type_2 ?v4 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v8 - type_2 ?v5 ?v7 - type_3)
       :precondition (and  (pred_4 ?v8 ?v5))
       :effect (and  (pred_4 ?v8 ?v7)
		     (not (pred_4 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_2 ?v3 - object ?v6 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v6) (pred_4 ?v8 ?v6) (pred_1 ?v8 ?v1))
       :effect (and (pred_3 ?v8 ?v3 ?v1)
		    (not (pred_2 ?v3 ?v6)) 
		    (not (pred_1 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_2 ?v3 - object ?v6 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v3 ?v1) (pred_4 ?v8 ?v6))
       :effect (and (pred_2 ?v3 ?v6)
		    (pred_1 ?v8 ?v1)
		    (not (pred_3 ?v8 ?v3 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_12 obj_08 - type_2
obj_05 obj_10 obj_03 obj_04 - type_1
obj_11 obj_06 obj_09 - type_3
obj_07 obj_02 obj_01 - object)
(:init
(pred_4 obj_12 obj_06)
(pred_1 obj_12 obj_05)
(pred_1 obj_12 obj_10)
(pred_4 obj_08 obj_11)
(pred_1 obj_08 obj_03)
(pred_1 obj_08 obj_04)
(pred_2 obj_07 obj_06)
(pred_2 obj_02 obj_06)
(pred_2 obj_01 obj_06)
)
(:goal
(and
(pred_2 obj_07 obj_09)
(pred_2 obj_02 obj_09)
(pred_2 obj_01 obj_09)
)
)

(:constraints
  (always (not (pred_4 obj_12 obj_09)))
)
)

; plan
1. (op_3 obj_12 obj_07 obj_06 obj_10)
   deleted: (pred_2 obj_07 obj_06) (pred_1 obj_12 obj_10)
   added: (pred_3 obj_12 obj_07 obj_10)
   goals met: 0 of 3
2. (op_2 obj_08 obj_11 obj_06)
   deleted: (pred_4 obj_08 obj_11)
   added: (pred_4 obj_08 obj_06)
   goals met: 0 of 3
3. (op_3 obj_12 obj_01 obj_06 obj_05)
   deleted: (pred_2 obj_01 obj_06) (pred_1 obj_12 obj_05)
   added: (pred_3 obj_12 obj_01 obj_05)
   goals met: 0 of 3
4. (op_3 obj_08 obj_02 obj_06 obj_04)
   deleted: (pred_2 obj_02 obj_06) (pred_1 obj_08 obj_04)
   added: (pred_3 obj_08 obj_02 obj_04)
   goals met: 0 of 3
5. (op_2 obj_08 obj_06 obj_09)
   deleted: (pred_4 obj_08 obj_06)
   added: (pred_4 obj_08 obj_09)
   goals met: 0 of 3
6. (op_1 obj_08 obj_02 obj_09 obj_04)
   deleted: (pred_3 obj_08 obj_02 obj_04)
   added: (pred_2 obj_02 obj_09) (pred_1 obj_08 obj_04)
   goals met: 1 of 3
7. (op_2 obj_08 obj_09 obj_06)
   deleted: (pred_4 obj_08 obj_09)
   added: (pred_4 obj_08 obj_06)
   goals met: 1 of 3
8. (op_1 obj_12 obj_07 obj_06 obj_10)
   deleted: (pred_3 obj_12 obj_07 obj_10)
   added: (pred_2 obj_07 obj_06) (pred_1 obj_12 obj_10)
   goals met: 1 of 3
9. (op_3 obj_08 obj_07 obj_06 obj_04)
   deleted: (pred_2 obj_07 obj_06) (pred_1 obj_08 obj_04)
   added: (pred_3 obj_08 obj_07 obj_04)
   goals met: 1 of 3
10. (op_2 obj_08 obj_06 obj_09)
   deleted: (pred_4 obj_08 obj_06)
   added: (pred_4 obj_08 obj_09)
   goals met: 1 of 3
11. (op_1 obj_08 obj_07 obj_09 obj_04)
   deleted: (pred_3 obj_08 obj_07 obj_04)
   added: (pred_2 obj_07 obj_09) (pred_1 obj_08 obj_04)
   goals met: 2 of 3
12. (op_2 obj_08 obj_09 obj_06)
   deleted: (pred_4 obj_08 obj_09)
   added: (pred_4 obj_08 obj_06)
   goals met: 2 of 3
13. (op_1 obj_12 obj_01 obj_06 obj_05)
   deleted: (pred_3 obj_12 obj_01 obj_05)
   added: (pred_2 obj_01 obj_06) (pred_1 obj_12 obj_05)
   goals met: 2 of 3
14. (op_3 obj_08 obj_01 obj_06 obj_04)
   deleted: (pred_2 obj_01 obj_06) (pred_1 obj_08 obj_04)
   added: (pred_3 obj_08 obj_01 obj_04)
   goals met: 2 of 3
15. (op_2 obj_08 obj_06 obj_09)
   deleted: (pred_4 obj_08 obj_06)
   added: (pred_4 obj_08 obj_09)
   goals met: 2 of 3
16. (op_1 obj_08 obj_01 obj_09 obj_04)
   deleted: (pred_3 obj_08 obj_01 obj_04)
   added: (pred_2 obj_01 obj_09) (pred_1 obj_08 obj_04)
   goals met: 3 of 3
